// 𐌀𐌀𐌀 𐌀𐌀 𐌀𐌀 𐌀𐌀 𐌀𐌀 VIM_TEST_SETUP let g:java_highlight_functions = 'ＡＡＡ'
// .......................................................................𐌀
// ...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀
// 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀
class MultibyteCharsTests /* ...... 𐌀 .................................. */
{ /** /// SEEK TO HAVE   ANY LINE   WITH "Ａ"  WRAPPED (SEE #16559) /// **/
// /// 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀
// /// ...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀
// /// ...................................................................𐌀
    static { /* ................... Ａ ................................. */
/* 𐌀 */ var Ａ01 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀02 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀03 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀04 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀05 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀06 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀07 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀08 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀09 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀10 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀11 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀12 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀13 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀14 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀15 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀16 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀17 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀18 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
// 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀
/* 𐌀 */ var 𐌀19 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var Ａ20 = ".𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀21 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀22 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀23 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀24 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀25 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀26 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀27 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀28 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀29 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀30 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀31 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀32 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀33 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀34 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀35 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀36 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
// 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀
/* 𐌀 */ var 𐌀37 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀38 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var Ａ39 = "....................................................𐌀";
/* 𐌀 */ var 𐌀40 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀41 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀42 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀43 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀44 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀45 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀46 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀47 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀48 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀49 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀50 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀51 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀52 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀53 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀54 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
// 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀
/* 𐌀 */ var 𐌀55 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀56 = ".𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // Ａ
/* 𐌀 */ var 𐌀57 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀58 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀59 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀60 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀61 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀62 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀63 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀64 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀65 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀66 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀67 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀68 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
/* 𐌀 */ var 𐌀69 = ".....................................................𐌀";
/* 𐌀 */ var 𐌀70 = "𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀.𐌀"; // 𐌀
/* 𐌀 */ var 𐌀71 = ".....................................................𐌀";
/* Ａ */ var 𐌀72 = "𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀";
// /////// ...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀
// /////// 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀
// /////// ...............................................................𐌀
    } /* .......................... Ａ ................................. */
// /// ...................................................................𐌀
// /// ...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀
// /// 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀
} /* .............................. 𐌀 .................................. */
// .......................................................................𐌀
// ...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀...𐌀
// 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀 𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀𐌀
